package day53;

public class Ex9 {

	/*
	 * 메소드 오버로딩
	 * - 가능여부
	 * 	- 매개변수 갯수가 다른경우
	 * 	- 리턴 변수가 다른 경우
	 * 
	 * 클래스
	 * - 클래스 멤버(static)
	 * 	- 모든 객체들이 공유하는 멤버
	 * 	- 객체를 생성하지 않고 호출
	 * 	- 클래스를 사용할 때
	 * - 객체멤버
	 * 	- 각 객체마다 멤버를 가지고 있다.
	 * 	- 객체를 생서한 후에 호출
	 * 	- 객체를 생성할 때(new 연산자를 통해)
	 *
	 * 클래스 멤버 변수를 클래스 멤버 메소드에서 호출 할 수 있다.o
	 * 클래스 멤버 변수를 객체 멤버 메소드에서 호출 할 수 있다.o / 왜냐면 클래스 멤버 변수는  import 하는 순간 생성 되기에 가능
	 * 객체 멤버 변수를 객체 멤버 메소드에서 호출 할 수 있다.o
	 * 객체 멤버 변수를 클래스 멤버 메소드에서 호출 할 수 있다.x / 반대로 객체 멤버는 new 연산자가 선언 되야 생성되기 때문에 불가.
	 * 
	 * */
	
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
